---
type: StructuralSectionLAngle
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 6
tags: [revit-api, class]
---

# StructuralSectionLAngle

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionLAngle | 2015 | `public StructuralSectionLAngle ( double width , double height , double flangeThickness , double webThickness , double webFillet , double flangeFillet , double centroidHorizontal , double centroidVertical , double princip` |
| Property | BoltDiameterLongerFlange | 2015 | `public double BoltDiameterLongerFlange { get ; set ; }` |
| Property | BoltDiameterShorterFlange | 2015 | `public double BoltDiameterShorterFlange { get ; set ; }` |
| Property | BoltSpacing1LongerFlange | 2015 | `public double BoltSpacing1LongerFlange { get ; set ; }` |
| Property | BoltSpacing2LongerFlange | 2015 | `public double BoltSpacing2LongerFlange { get ; set ; }` |
| Property | BoltSpacingShorterFlange | 2015 | `public double BoltSpacingShorterFlange { get ; set ; }` |